# Ordinal Encoder
Ordinal encoder transforms the categorical values to numerical with a higher number for a category high in rank

In [1]:
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder

In [2]:
dict = {'sales': [100000,222000,1000000,522000,111111,222222,1111111,20000,75000,90000,1000000,10000],
      'city': ['Tampa','Tampa','Orlando','Jacksonville','Miami','Jacksonville','Miami','Miami','Orlando','Orlando','Orlando','Orlando'],
      'size': ['Small', 'Medium','Large','Large','Small','Medium','Large','Small','Medium','Medium','Medium','Small',]}

In [3]:
df = pd.DataFrame(dict)
df.head(5)

     sales          city    size
0   100000         Tampa   Small
1   222000         Tampa  Medium
2  1000000       Orlando   Large
3   522000  Jacksonville   Large
4   111111         Miami   Small

In [26]:
categories = df['size'].unique()
categories

array(['Small', 'Medium', 'Large'], dtype=object)

In [32]:
from sklearn.preprocessing import OrdinalEncoder
oe = OrdinalEncoder(categories=[categories]) # Order matters: 'Small', 'Medium', 'Large'

In [33]:
encoded = df.copy()
encoded['size'] = oe.fit_transform(df[['size']])
encoded

      sales          city  size
0    100000         Tampa   0.0
1    222000         Tampa   1.0
2   1000000       Orlando   2.0
3    522000  Jacksonville   2.0
4    111111         Miami   0.0
5    222222  Jacksonville   1.0
6   1111111         Miami   2.0
7     20000         Miami   0.0
8     75000       Orlando   1.0
9     90000       Orlando   1.0
10  1000000       Orlando   1.0
11    10000       Orlando   0.0